Revit 2026 API

# SlabShapeEditorModifySubElement(SlabShapeVertex, Double) Method

---

Manipulates the vertex on the corresponding slab, roof or floor.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ModifySubElement(
	SlabShapeVertex vertex,
	double offset
)
```
```vb
Public Sub ModifySubElement (
	vertex As SlabShapeVertex,
	offset As Double
)
```
```cpp
public:
void ModifySubElement(
	SlabShapeVertex^ vertex,
	double offset
)
```
```fsharp
member ModifySubElement :
        vertex : SlabShapeVertex *
        offset : float -> unit
```

#### Parameters

vertex SlabShapeVertex
    The vertex.
offset Double
    The new value of the vertex offset.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the vertex is . |
| ArgumentException | Thrown when the vertex is invalid. |

#### Reference

SlabShapeEditor Class

ModifySubElement Overload

Autodesk.Revit.DB Namespace